       01  ASSET-INPUT-RECORD.
           05  NAME-IN             PICTURE X(10).
           05  PRICE-IN            PICTURE S9(5)V99.
           05  SALVAGE-IN          PICTURE S9(5)V99.
           05  USEFUL-LIFE-IN      PICTURE 99.
