       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEPRSUB.

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01   PRICE-IN            PICTURE S9(5)V99.
       01   SALVAGE-IN          PICTURE S9(5)V99.
       01   USEFUL-LIFE-IN      PICTURE 99.
       01   YEARLY-DEPR-WS      PICTURE S9(5)V99.
       01   TOTAL-DEPR-WS       PICTURE S9(6)V99.

       PROCEDURE DIVISION USING PRICE-IN, SALVAGE-IN, USEFUL-LIFE-IN,
                          YEARLY-DEPR-WS, TOTAL-DEPR-WS.

       100-MAINLINE.

           COMPUTE YEARLY-DEPR-WS = (PRICE-IN - SALVAGE-IN)
                   / USEFUL-LIFE-IN

           ADD   YEARLY-DEPR-WS  TO  TOTAL-DEPR-WS.

           EXIT PROGRAM.

